cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "amazon-photos"
cask "background-music"
cask "bettertouchtool"
cask "biscuit"
cask "blackhole-2ch"
cask "clipy"
cask "docker-desktop"
cask "dropbox"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "messenger"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
