brew "bat"
brew "brew-cask-completion"
brew "coreutils"
brew "curl"
brew "eza"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "jq"
brew "mas"
brew "mise"
brew "peco"
brew "sheldon"
brew "shellcheck"
brew "tnftp"
brew "tree"
brew "xdg-ninja"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
