tap "homebrew/bundle"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "coreutils"
brew "asdf"
brew "brew-cask-completion"
brew "curl"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "jq"
brew "mas"
brew "mysql"
brew "peco"
brew "postgresql@14"
brew "tnftp"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "amazon-photos"
cask "android-platform-tools"
cask "bettertouchtool"
cask "biscuit"
cask "clipy"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "kindle-previewer"
cask "messenger"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "visual-studio-code"
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "BetterSnapTool", id: 417375580
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MARKETSPEED", id: 946680495
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "bibhasdn.unique-lines"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "fabiospampinato.vscode-diff"
vscode "formulahendry.code-runner"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "ryu1kn.partial-diff"
vscode "shinichi-takii.sql-bigquery"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wmaurer.change-case"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
